{
    "react": [
        {
            "name": "Portfolio",
            "image": "/portfolio.png",
            "linkCode": "https://github.com/dsmontecastro/Portfolio",
            "linkProj": "https://dsmontecastro.github.io/Portfolio/",
            "desc": [
                "THIS website was created using React, Vite, TypeScript, and TailwindCSS.",
                "As a challenge, it makes use of as few external packages and images;",
                "other than EmailJS & QoL modules, it makes the most out of pure React.",
                "The code structure emphasized scalability,",
                "maximizing the maintainability of the project",
                "while minimizing the amount of changes to be made to files during updates."
            ]
        },
        {
            "name": "Sungka Online",
            "image": "/sungka.png",
            "linkCode": "https://github.com/dsmontecastro/Sungka",
            "linkProj": "https://dsmontecastro.github.io/Sungka/",
            "desc": [
                "My introduction to both React and the Full-Stack environment.",
                "This application uses Typescript and Sockets.io to operate rooms and matches for Sungka.",
                "Code for both the front (server) and back (client) ends can be found in the repository.",
                "Since this entire idea initially came from a chat app, said feature was also implemented.",
                "Future improvements to be made generally lie in the CSS and layout configuration."
            ]
        }
    ],
    "python": [
        {
            "name": "Word-Game",
            "image": "/word_game.png",
            "linkCode": "https://github.com/dsmontecastro/Word-Game",
            "linkProj": null,
            "desc": [
                "A Wordle-esque game before Wordle peaked in popularity, made using Python & PyGame.",
                "It was made in around 1 month as a group project during our 1st semester as freshmen (2018).",
                "This was mostly an exploratory assessment, giving us free reign to make any creative application.",
                "The assets & majority of the game logic were handled by the other 2 members,",
                "with most of my duties revolving around the UI/UX systems, specifically the GUI & player controls."
            ]
        },
        {
            "name": "PythonDex",
            "image": "/pythondex.png",
            "linkCode": "https://github.com/dsmontecastro/PythonDex",
            "linkProj": null,
            "desc": [
                "A prototype PokeDex application made primarily via Python's Pyglet module.",
                "It was made in around 1 month as a group project during our 1st semester as freshmen (2018).",
                "This was another \"free\" project, allowing us to develop whatever idea came to mind.",
                "My role for this project was implementing the GUI,",
                "including the custom scrollbar and OpenGL-based radar-chart for the stats."
            ]
        }
    ],
    "csharp": [
        {
            "name": "Thesis Project",
            "image": "/thesis.jpg",
            "linkCode": "https://github.com/dsmontecastro/Thesis",
            "linkProj": null,
            "desc": [
                "The research topic is titled \"The Effects of Active Listening in a Virtual Classroom\".",
                "This is a qualitative study that uses focused-group discussions (FGDs)",
                "among pairs teachers and students from different levels of higher education.",
                "These talks were held in a custom virtual classroom with virtual avatars to simulate a \"physical\" setting.",
                "Said learning space was built using the Godot Engine (3.5) with GodotSteam to handle multiplayer protocols.",
                "The avatars simulated simple student expressions via the head position & facial expression",
                "as well as hand and body gestures to simulate physical behaviors.",
                "The discussions emphasized the importance of said physical cues in student-teacher interactions,",
                "which are obviously missing in virtual classrooms that were held in online meeting rooms prevalent during the pandemic."
            ]
        },
        {
            "name": "Games of the Generals Online",
            "image": "/gog.png",
            "linkCode": "https://github.com/dsmontecastro/GoG",
            "linkProj": null,
            "desc": [
                "A virtual, multiplayer simulation of the local PH game, Games of the Generals.",
                "It uses the Godot Engine (3.5) for the game proper along with the GodotSteam module.",
                "Through the Steam Lobby system, it essentially runs serverless,",
                "utilizing Steam's matchmaking and peer-to-peer (P2P) protocols for passing data.",
                "While the room, matchmaking, and game logic are all functional,",
                "the design, assets, and debugging require more work."
            ]
        }
    ],
    "flutter": [
        {
            "name": "Dexy",
            "image": "/dexy.png",
            "linkCode": "https://github.com/dsmontecastro/Dexy",
            "linkProj": null,
            "desc": [
                "A PokeDex app made in Flutter/Dart, for Desktop & Mobile, based on the PythonDex prototype.",
                "It uses resources from PokeAPI,",
                "storing the necessary data to a local SQFLite database through custom-built wrappers.",
                "The sprites were scraped through a different process, instead saved as static image assets.",
                "This is still around half-way through development, having only the major features working.",
                "Updates would implement the remaining screens for displaying more Pokemon data,",
                "as well as allowing the user to access API & theme controls."
            ]
        }
    ]
}